from django.shortcuts import render, redirect, get_object_or_404
from django.urls import reverse
from django.http import HttpResponse
from .forms import LoginForm
from django.views.generic import View
def index(request):
    return render(request, 'index.html')

def login_view(request):
    if request.method == 'POST':
        form = LoginForm(request.POST)
        if form.is_valid():
            form.save()  
            return redirect('success_page') 
    else:
        form = LoginForm()

    return render(request, 'login.html', {'form': form})
def toppick(request, id):

    movies = {
        1: {
            'title': 'Green Book',
            'description': ' Green book กรีนบุ๊ค หนังที่อ้างอิงมาจากเรื่องจริงของนักดนตรีผิวสีอย่าง ดอน เชอร์ลีย์ กับคนขับรถของเขาชาวอเมริกันเชื้อสายอิตาเลียนอย่าง โทนี ลิป ที่ย้อนกลับไปในปี 1930-1960 ที่คนผิวสีในอเมริกานั้นต้องพกหนังสือที่ชื่อว่า "The Negro Motorist Green Book" หรือเรียกสั้นๆว่า "Green Book" ที่เป็นเหมือนหนังสือไกด์แนะนำร้านอาหาร โรงแรม หรือสถานที่ที่ต้อนรับคนผิวสีในขณะนั้น เพราะในช่วงเวลานั้นมีการเหยียดผิวที่รุนแรงมากถึงขั้นเสียชีวิตเลยก็มีในการเดินทางไปทั่วอเมริกาเพื่อทำการแสดง แต่ในยุคนั้นมีการเหยียดผิวที่รุนแรงเกือบทั่วอเมริกา',
            'director': 'Peter Farrelly',
            'release_date': '2018-11-16',
            'genre': 'Drama, Comedy',
            'info' : 'Green Book คือผลงานที่นำแสดงโดยสองนักแสดงฝีมือคุณภาพ วิกโก้ มอร์เทนเซน ผู้เข้าชิงสองรางวัลออสการ์จาก Eastern Promises, Captain Fantastic ร่วมด้วย มาเฮอร์ชาลา อาลี เจ้าของรางวัลออสการ์จาก Moonlight เล่าถึงเรื่องราวของ สองคู่หูต่างขั้วที่จับผลัดจับผลูตระเวนเดินทางไปทั่วตอนใต้ของอเมริกาด้วยกัน “โทนี่ ลิป” (วิกโก้ มอร์เทนเซน) พี่ล่าขาใหญ่เชื้อสายอิตาเลียน-อเมริกันจากย่านบรองซ์ในนิวยอร์ก ต้องมาเป็นคนขับรถให้ “ดอน เชอร์ลีย์” (มาเฮอร์ชาลา อาลี) นักเปียโนคลาสสิคผิวสีระดับโลก ระหว่างที่เขาออกเดินสายขึ้นแสดงในยุค 60 สิ่งเดียวที่นำทางทั้งคู่คือ “สมุดปกเขียว” ที่บอกสถานที่ที่เป็นมิตรกับคนผิวสี พวกเขาต้องฝ่าทั้งกำแพงแห่งสีผิว ภัยอันตรายต่าง ๆ เช่นเดียวกับน้ำใจจากเพื่อนมนุษย์ในการเดินทางครั้งสำคัญนี้',
            'info2' : 'ผู้กำกับหนังสายฮา ปีเตอร์ ฟาร์เรลลี่ ที่ดังจากผลงานตลกเป็นส่วนมากทั้ง Dumb and Dumber (1994) และ There’s Something About Mary (1998) กลับมาอีกครั้งพร้อมเปลี่ยนแนวมาสายดราม่าอารมณ์ดีที่เปรี้ยงถึงขนาดเข้าชิงรางวัลลูกโลกทองคำถึง 5 สาขาด้วยกัน (ภาพยนตร์เพลงหรือตลกยอดเยี่ยม /บทภาพยนตร์ /กำกับภาพยนตร์ /นักแสดงนำชาย /นักแสดงสมทบชาย) ซึ่งน่าสนใจมากทีเดียว และในนาทีพูดได้เลยว่านี่เป็นหนังที่น่ารักโคตร ๆ อมยิ้มและขำรัว ๆ ยิ่งไม่อยากให้หนังจบเลยด้วยซ้ำ เหมือนเราดูคู่หูต่างขั้วคู่นี้ไปได้เรื่อย ๆ แบบไม่รู้จบเลย เรียกว่าฟาร์เรลลี่ดึงทักษะหนังตลกที่เชี่ยวชาญมาผสมหนังชีวิตได้โคตรฟีลกู้ดเลย ตกหลุมรักมากกกก',
            'info3' : 'หนังเอาเรื่องจริงเกี่ยวกับประวัติศาสตร์การเหยียดผิวอันเลื่องชื่อของอเมริกาในช่วงยุค 1930-1960 ที่คนผิวสีต้องพกหนังสือชื่อ “The Negro Motorist Green Book” ซึ่งภายหลังชื่อเรียกเหลือแค่ Green Book ที่พิมพ์มาเป็นไกด์แนะนำว่ามีร้านอาหาร โรงแรม หรือสถานที่ใดที่ยินดีต้อนรับคนผิวสีบ้าง เพราะยุคนั้นถ้าหลงเข้าไปที่ที่มีการเหยียดรุนแรงอาจถูกทำร้ายจิตใจทางวาจา หรืออาจหนักกว่านั้นจนเสี่ยงชีวิตเลยก็ได้',
            'info4' :'ที่สุดในยุคนั้นก็คือ มิตรภาพของคนต่างผิวสีต่างนิสัยและต่างที่มา ซึ่งเกิดขึ้นจริงในวงการบันเทิงอย่าง ดร.ดอน เชอร์ลีย์ นักเปียชื่อดังระดับโลก กับบอดี้การ์ดอิตาลีสุดกระด้างจากย่านกุ๊ยของนิวยอร์กอย่าง โทนี่ ลิป วัลเลลองก้า ที่ถูกว่าจ้างให้ติดตามดูแลครั้งที่ ดร.เชอร์ลีย์ ต้องเดินทางแสดงผลงานในภาคใต้ของอเมริกาซึ่งมีประวัติการเหยียดผิวรุนแรงที่สุดเพราะเป็นดินแดนที่ค้าทาสผิวสีเดิม ก่อนที่จะแพ้สงครามกลางเมืองและมีการบังคับเลิกทาสไปในที่สุดสมัยประธานาธิบดีลินคอล์น แต่กระนั้นความรุนแรงของการเหยียดผิวก็ยังฝังรากลึกในวัฒนธรรมแดนใต้อยู่ต่อมายาวนาน การเดินทางแสดงดนตรีธรรมดาจึงมีเรื่องราวมากกว่าแค่การนั่งรถชมวิวแน่นอน',
            'info5': 'หนังได้ดาราชั้นนำมารับบทคนที่มีอยู่จริงอย่างนักแสดงนำ วิกโก้ มอร์เทนเซน หรือ อารากอน จาก The Lord of the Rings มารับบท โทนี่ ลิป และได้ดาราเจ้าของรางวัลสมทบชายออสการ์จากหนัง Moonlight (2016) อย่าง มาเฮอร์ชาลา อาลี มารับบท ดร.ดอน เชอร์ลีย์  และดอกไม้ชูโรงของหนังก็ได้ ลินดา คาร์เดลลินี่ จาก Brokeback Mountain (2005) มารับบท โดโลเรส ภรรยาของโทนี่ ลิป ด้วย',
            'info6': 'หลายคนอาจจะคุ้นหน้าของ โทนี่ ลิป ตัวจริง เพราะภายหลังจากเรื่องราวในหนังนั้น เขาก็สร้างเนื้อสร้างตัวจนเป็นเจ้าของกิจการไนท์คลับชื่อดัง และกลายเป็นหนึ่งในดารารับเชิญที่มักปรากฏตัวในหนังของผู้กำกับดังอย่าง ฟรานซิส ฟอร์ด คอปโปลา ซิดนีย์ ลูเมท และ มาร์ติน สกอร์เซซี  โดยครั้งแรกเขาเล่นบทรับเชิญแขกในฉากงานแต่งของ The Godfather (1972) และที่น่าจะจำได้มากสุดคือการรับบท คาร์ไมน์ ลูเปอร์ทาสซี่ ในซีรีส์ The Sopranos นั่นเอง ซึ่งเสน่ห์ของหนังส่วนมากเลยต้องบอกว่ามาจากตัวของโทนี่ ลิป นี่เองเลยล่ะ เพราะแม้จะหยาบกระด้างแต่เขาสัมผัสได้ และแม้จะแข็งนอกแต่ภายในเขามีมุมอ่อนโยน มีเสน่ห์ในการพูดจาหว่านล้อม เป็นลูกผู้ชายที่ถือสัจจะเป็นคนจริง และเป็นนักเลงในแบบที่ใครก็เกลียดไม่ลงเลย ซึ่งมอร์เทนเซนก็ถ่ายทอดออกมาได้อย่างไร้ที่ติ เป็นการพลิกทั้งรูปลักษณ์ และการแสดงที่เขาเคยทำได้อย่างน่าทึ่ง เราแทบลืมไปเลยว่านี่คือการแสดง และคนที่อยู่บนจอคือมอร์เทนเซน',
            'info7': 'ในด้านของอาลี ที่รับบท ดร.ดอน เชอร์ลีย์ นั้นก็ต้องคารวะอีกครั้ง เพราะใน Moonlight เราอาจติดภาพนักเลงข้างถนนของเขามาอย่างตราตรึง แต่ในเรื่องนี้เขาก็พลิกเป็นชายผิวสีไฮโซ การศึกษาสูง ผู้มีรสนิยมสูงแปลกแยกจากคนอื่น และดูอ้างว้างโดดเดี่ยวอยู่เสมอได้อย่างน่าทึ่ง การที่ต้องเล่นเป็นนักเปียโนระดับเทพอาลีก็ฝึกฝนและถ่ายทอดการแสดงเปียโนที่สมจริงได้อย่างไม่มีอะไรให้ติติงเลย และการเข้าคู่ของทั้งคู่ทั้งอาลีและมอร์เทนเซนคือความน่าประทับใจที่เห็นถึงมิตรภาพของความแตกต่าง การยอมรับนับถือในกันและกันของผู้ชายสองคนที่สวยงามมาก ๆ ตราตรึงมาก ๆ ด้วย',
            'info8': 'คือดูแล้วเหมือนเพิ่งได้พบกับเพื่อนสนิทที่คุยถูกคอมาก ๆ ทีเดียวสองคน และเราก็อยากเป็นเพื่อนกับเขาต่อไปทั้งชีวิตเลย',
            'info9': 'และที่ต้องชื่นชมที่สุดแห่งที่สุดคงเป็นงานเขียนบทและการกำกับ โดย ปีเตอร์ ฟาร์เรลลี่ อย่างที่ได้พูดมาว่าใช้ทักษะที่ชำนาญในหนังตลกแมส ๆ มาสู่หนังดราม่าได้อย่างคมคายและน่าทึ่งมาก ๆ เกินความหมายสุด ๆ และส่วนหนึ่งที่บทคมคายและสมจริงได้ขนาดนี้ก็ต้องชื่นชมมือเขียนบทร่วมที่ได้ลูกชายของโทนี่ ลิปตัวจริงอย่าง นิก วัลเลลองก้า มาช่วย รวมถึง ไบรอัน เฮย์ส เคอรรี่ ดาราตัวประกอบรุ่นเก๋าที่มาเสริมบทหนังได้อย่างดี มีคำพูดดี ๆ คม ๆ และน่าจดจำมากมาย มันคือหนังที่สมบูรณ์แบบในบทแบบชนิดไร้ช่องโหว่ และการถ่ายทอดผ่านกิมมิกของสีเขียวก็ถูกวางไว้ตลอดเรื่องก็ผลักดันให้เราดูไปคิดไป',
            'info10': 'รวมๆ แล้ว Green Book ไม่ใช่หนังที่ทะเยอทะยาน ทั้งในแง่ของเนื้อหาสาระซึ่งก็ดังที่กล่าวว่าไม่ได้พาผู้ชมไปรับรู้อะไรที่แปลกใหม่ หรือวิธีการนำเสนอซึ่งก็ดำเนินตามสูตรสำเร็จ แต่อย่างที่ใครๆ ก็น่าจะบอกได้เหมือนกัน ส่วนสำคัญของความสนุกสนานและตลกขบขันของหนังมาจากแอ็กติ้งที่สอดประสานกลมกลืนระหว่างสองนักแสดงที่พวกเขาอาจจะไม่มีภาพของการเล่นหนังตลกมาก่อนหน้าอย่างจริงๆ จังๆ กระนั้นก็ตาม การเฝ้าดูทั้งวิกโก มอร์เทนเซน และมาเฮอร์ชาลา อาลี รับส่งบทบาทที่ฉูดฉาดบาดตา แลกเปลี่ยนทัศนคติและความเห็นด้วยปฏิภาณไหวพริบอันแหลมคม และแน่นอนว่าผ่านการแสดงออกอย่างหน้าตายและอมพะนำ ก็สามารถเรียกเสียงหัวเราะได้อย่างสนั่นหวั่นไหวและครึกโครม',
            'info11' : 'แต่นั่นก็ไม่ใช่ทั้งหมดที่การแสดงอันล้ำเลิศของคนทั้งสองหยิบยื่น และในห้วงเวลาที่ตัวละครต้องเผชิญกับภาวะบีบคั้นกดดัน เราก็สัมผัสได้ถึงความอ่อนไหว อ่อนโยน ความห่วงหาอาทรในฐานะเพื่อนร่วมวิบากกรรม และทั้งหลายทั้งปวง มันไม่เพียงทำให้สิ่งละอันพันละน้อยที่ได้รับการบอกเล่าเต็มเปี่ยมไปด้วยสีสัน ความสนุกสนาน และความมีชีวิตชีวา',
            'poster': 'POSTER1.png',
            'video': 'green.mp4',
            'img' : 'greenbookactor.jpg',
            'actor_image': 'greenbook_info.jpg',
            'actor_image2': 'greenbook_info2.jpg',
            'actor_image3': 'greenbook_info3.jpg',
            'actor_image4': 'greenbook_info4.jpg',
            'actor_image5': 'greenbook_info5.jpg',
            'actor_image6': 'greenbook_info6.jpg',
            'actor_image7': 'greenbook_info7.jpg',
            'actor_image8': 'greenbook_info8.jpg',
            'actor_image9': 'greenbook_info9.jpg',
            'actor_image10': 'greenbook_info10.jpg',
            'actor_image11': 'greenbook_info11.jpg',
            'actors': [
                {'name': 'Viggo Mortensen', 'image': 'Viggo Mortensen.JPG'},
                {'name': 'Mahershala Ali', 'image': 'Mahershala Ali.JPG'},
                {'name': 'Linda Cardellini', 'image': 'Linda Cardellini.JPG'},
                {'name': 'Sebastian Maniscalco', 'image': 'seb.jpg'},
                {'name': 'Dimiter D. Marinov', 'image': 'dimi.jpg'},
                {'name': 'Joe Cortese', 'image': 'joe.jpg'},
                {'name': 'Irene Sirko', 'image': 'ire.jpg'},
                {'name': 'P.J. Byrne', 'image': 'pj.jpg'},
                {'name': 'Michael McKinney', 'image': 'mic.jpg'},
                {'name': 'Misty Copeland', 'image': 'mic2.jpg'},
            ]
        },
        2: {
            'title': 'Black Panther',
            'description': 'เรียกว่าเป็นโปรแกรมหนังซูเปอร์ฮีโรของ Marvel Studios ที่รอคอยมากที่สุดของปีนี้แล้วล่ะครับ สำหรับ ‘Black Panther: Wakanda Forever’ หรือ ‘แบล็ค แพนเธอร์: วาคานด้าจงเจริญ’ ถ้าพูดในเชิงของภาพยนตร์ นี่คือหนังภาคต่อของ ‘Black Panther’ (2018) หนังซูเปอร์ฮีโรที่ครองใจคนทั้งโลกและนักวิจารณ์หลังออกฉาย สร้างรายทั่วโลกถล่มทลายกว่า 1,346 ล้านเหรียญ แถมยังเป็นหนังค่าย Marvel เรื่องแรกที่ได้รับการเสนอชื่อเข้าชิงรางวัลออสการ์สาขาภาพยนตร์ยอดเยี่ยม ก่อนจะคว้ามาได้ถึง 3 รางวัล แต่ถ้าพูดในแง่ของหนังภายใต้จักรวาล MCU (Marvel Cinematic Universe) หนังเรื่องนี้คือหนังปิดจักรวาลเฟส 4 ครับ ตัวหนังภาคนี้ก็เลยมีความน่าสนใจว่า จะเล่าเรื่องและทำหน้าที่ส่งจักรวาลสู่เฟส 5 และ 6 ที่จะเกิดขึ้นในอนาคตในทิศทางใด',
            'director': 'Ryan Coogler',
            'release_date': '2018-02-16',
            'genre': 'Action, Adventure',
            'info' : 'และอีกเหตุผลที่สำคัญที่แฟน ๆ ทั่วโลกต่างคาดหวังมากที่สุดก็คือ การจากไปของนักแสดงเจ้าของบทบาท แบล็ก แพนเธอร์ อย่าง แชดวิก โบสแมน (Chadwick Boseman) ด้วยโรคมะเร็งลำไส้ใหญ่ แม้ว่าเรื่องราวหนังเดี่ยวของราชาเสือดำจะยังคงเดินหน้า แต่ด้วยการจากไปของนักแสดงที่แจ้งเกิดและเป็นที่รักของคนทั้งโลกนั้นถือว่าเป็นการสูญเสียที่ยิ่งใหญ่เกินกว่าจะรับไหว จนขนาดที่ เควิน ไฟกี (Kevin Feige) ได้ตัดสินใจชัดเจนว่าไม่แคสต์นักแสดง และไม่ใช้ CGI เนรมิตฝ่าบาททีชัลลาคนใหม่ ก็ยิ่งสร้างความสงสัย คาดเดา และคาดหวังไปต่าง ๆ นานาว่า Marvel จะขับเคลื่อนเรื่องราวของแบล็ก แพนเธอร์ ในแบบที่ไม่มีโบสแมน ไม่มีทีชัลลาได้อย่างไร แล้วใครจะเข้ามาสืบทอดตำแหน่ง แบล็ก แพนเธอร์ คนใหม่กันแน่',
            'info2' : 'ไรอัน คูเกลอร์ (Ryan Coogler) ผู้กำกับ และ โจ โรเบิร์ต โคล (Joe Robert Cole) ผู้เขียนบทร่วมกับคูเกลอร์จากภาคแรก กลับมาร่วมกันถ่ายทอดเรื่องราวของชาววาคานด้า ทีแรกตัวบทจะต่อเรื่องราวของทีชัลลา ในฐานะกษัตริย์แห่งวาคานด้า หลังจากใน ‘Avengers: Endgame’ ครับ แต่ด้วยการจากไปของโบสแมน ตัวหนังก็เลยเบนเข็มไปสำรวจเรื่องราวของการถ่ายทอดวัฒนธรรมของวาคานด้า ตัวละคร และความวุ่นวายหลังจากการเปิดประเทศสู่โลกภายนอกจากภาคแรกแทน โดยจะเล่าเรื่องจากเหตุการณ์หลังการสวรรคตของกษัตริย์ทีชัลลา (Chadwick Boseman) ทำให้ ราชินีรามอนดา (Angela Bassett) ต้องขึ้นนั่งบัลลังก์แทน แต่สุดท้ายพระองค์ก็ไม่ได้เถลิงราชย์ได้ง่ายดายนัก เจ้าหญิงซูริ (Letitia Wright) เองก็ยังคงรับมือกับการจากไปของพี่ชายไม่ได้',
            'info3' : 'ในขณะที่เธอเองก็ไม่เชื่อว่า แบล็ก แพนเธอร์ ตำนานเทพเจ้าเสือดำของเหล่าบรรพชนจะกลับมาได้อีก ในขณะที่การบ้านการเมืองของวาคานด้าก็กำลังระส่ำระสายจากภัยจากต่างชาติ และการรุกรานของ เนมอร์ (Tenoch Huerta) หัวหน้าชนเผ่าใต้ทะเล ทาโลคาน (Talokan) ที่บุกขึ้นมารุกรานโลกด้านบนและหวังจะกำราบวาคานด้าให้สิ้นซาก พวกเธอและ เอ็มบากู (Winston Duke), นายพลโอโคเย (Danai Gurira) หัวหน้านักรบโดรามิลาเจ (Dora Milaje), นาเกีย (Lupita Nyong’o) นักสอดแนมแห่งวาคานด้า รวมทั้งหัวหน้าซีไอเอ เอฟเวอร์เร็ตต์ รอสส์ (Martin Freeman) และสาวน้อยอัจฉริยะ ริรี วิลเลียมส์/ไอรอนฮาร์ต (Dominique Thorne) จึงต้องร่วมมือกันเพื่อปกป้องอันตรายใหญ่หลวงที่เข้ามาในช่วงที่วาคานด้าอ่อนไหวที่สุด',
            'info4' :'สำหรับภาคนี้ในความรู้สึกของผู้เขียน จริง ๆ แล้วก็ต้องเรียนกันตามตรงว่า ไม่ถือว่าเกินความคาดหวังนะครับ คือเรียกได้ว่าเป็นไปตามที่หวัง และก็ถือว่าทำได้ออกมาดีเท่าที่หวังเลยแหละ อย่างแรกก็คือ การระลึกถึง แชดวิก โบสแมน ที่ปรากฏในซีนแรก ๆ ของหนังที่ใช้สำหรับ Tribute หรืออุทิศให้กับราชาเสือดำผู้วายชนม์ และโบสแมนอย่างเต็มเม็ดเต็มหน่วยเลย ไม่เว้นแม้แต่โลโก้ Marvel Studio เวอร์ชันพิเศษ ที่ทำเอาผู้เขียนเองที่ว่าใจแข็ง ๆ พอเห็นโลโก้เวอร์ชันนี้ก็ยังแอบหลั่งน้ำตาป้อย ๆ หลังแว่น IMAX 3D เหมือนกันนะครับ เชื่อว่าวิญญาณของโบสแมนมองลงมาคงดีใจนะ',
            'info5': 'แต่หลังจากที่ตัวหนัง Tribute ให้กับโบสแมนและ แบล็ก แพนเธอร์ เสร็จสิ้นแล้ว ตัวหนังก็เลือกที่จะมีฉากที่แสดงถึงการมูฟออนจากความโศกเศร้าอย่างรวดเร็วครับ แล้วตัวหนังก็หยิบเอาจุดแข็งจากหนังภาคแรกมาใช้ นั่นก็คือตัวหนังยังคงไม่ได้เล่าพาดพิงเกี่ยวกับจักรวาล MCU มากนัก เพื่อหันไปเน้นหนักกับวัฒนธรรมพื้นถิ่นของวาคานด้า และการปูเรื่องราวในประเด็นที่ทับซ้อน ทั้งดราม่าการเมืองที่ยังเกี่ยวพันกับแร่ไวเบรเนียม ดราม่าครอบครัวและความศรัทธาของราชินีรามอนดา และเจ้าหญิงซูริ ที่มาบรรจบกันท่ามกลางบริบทของเมืองวาคานด้าที่โคตรจะเฉพาะตัว เพราะมีแร่ไวเบรเนียม มีวิทยาการทันสมัย ร่ำรวยที่สุดในโลก แต่ดันเต็มไปด้วยความลี้ลับ พิธีกรรม ความเชื่อเกี่ยวกับบรรพชนลอยอวลอยู่ไม่ห่าง ทั้งการระลึกถึงผู้วายชนม์ หรือการสืบทอด แบล็ก แพนเธอร์ ที่ปูเรื่องไว้แบบคม ๆ แล้วในภาคแรก พอมาภาคนี้ตัวหนังก็ตามมาต่อยอดได้อย่างน่าสนใจว่า แบล็ก แพนเธอร์ จะกลับมาได้อย่างไรถ้าไม่มีใบไม้รูปหัวใจแล้ว',
            'info6': 'ก่อนที่ตัวหนังจะขับเคลื่อนด้วยเส้นเรื่องหลักของตัวหนังก็คือ การรุกรานของเนมอร์ และเผ่าทาโลคาน ที่ตัวหนังให้เวลาในการปูเรื่องเกี่ยวกับตัวละครใหม่ ทั้งเนมอร์ และไอรอนฮาร์ต ที่จริง ๆ แล้วยัยไอรอนฮาร์ตนี่แหละที่เป็นตัวเดินเรื่องสำคัญในภาคนี้ ก่อนที่ทุกอย่างจะโยงไปถึงเนมอร์ ที่ถูกวางตัวให้เป็นมิวแทนต์ที่มีความเป็นแอนตี้ฮีโร ไม่ได้เป็นวายร้ายแบบตรง ๆ ซึ่งจริง ๆ แล้วพลังของเนมอร์เองก็มีความเท่ แล้วก็มีศักยภาพ และปูมหลังที่คอยหนุนให้มีมิติที่น่าสนใจมาก ๆ เลยนะครับ คืออาจจะไม่ได้มีบทบาทที่เหลื่อมซ้อนและมีมิติที่ทำให้เราลังเลในจุดยืนได้เท่ากับที่คิลมองเกอร์ทำได้ในภาคแรก ตรงข้าม เนมอร์เวลาอ่อนโยนนี่ก็หล่อเชียว แต่เวลาดุนี่ก็อำมหิตเหมือนกันนะ ส่วนกองทัพทาโลคานนี่ก็มาจังหวะสยองขวัญเลย',
            'info7': 'และด้วยความจากไปของทีชัลลา และตัวละครผู้นำที่เป็นผู้ชายบางส่วนจากภาคแรกหายไปเกือบหมด มันก็ปฏิเสธไม่ได้ว่าโทนของหนังก็เลยถูกปรับมีความเป็นสตรีนิยม (Feminine) เพราะดันเหลือตัวละครหลักที่เป็นผู้หญิงแทบจะทั้งหมดอย่างหลีกเลี่ยงไม่ได้ แกนนำที่อยู่ข้างหลังทั้งซูริ ราชินีรามอนดา โอโคเย และนาเกีย (และน้องริริ วิลเลียมส์) ก็เลยต้องรวมหัวกันสู้เพื่อปกป้องวาคานด้าในสถานการณ์ที่อ่อนไหวที่สุด ซึ่งตัวหนังเองก็เข้าใจตรงนี้ดี สามารถวางให้ตัวหนังขับเน้นจริตความเป็นสตรีนิยมด้วยแกนเรื่องที่ชัดเจนว่า ต้องการจะเล่าเรื่องของการต่อสู้ของเหล่าผู้หญิงเพื่อปกป้องดินแดนอันเป็นที่รัก (จากโลกมหาอำนาจและผู้ชายขามีปีก) แถมพวกเธอเองก็ยังต้องรับมือ พยุงจิตใจจากการจากไปของบุคคลอันเป็นที่รัก โทนของตัวหนังเลยออกมาต่างจากภาคแรกที่ผู้ช้ายผู้ชายอยู่พอสมควร',
            'info8': 'มันไม่ใช่หนังหญิงแกร่งแนวโชว์พลังว่าผู้หญิงก็มีดีไม่แพ้ผู้ชาย หรือผู้หญิงก็ซ่าได้เพียงอย่างเดียว แต่เป็นหนังพลังหญิงที่ขับเคลื่อนด้วยความรู้สึก การต่อสู้ การตัดสินใจ และความอ่อนไหวแบบผู้หญิง ผ่านการดำเนินเรื่องของตัวหนังที่ค่อย ๆ เล่าอย่างแช่มช้อย และเหล่านักแสดงหญิงทั้งหมดต่างก็แสดงศักยภาพออกมาได้ทรงพลังไม่แพ้กันเลย ราชินีรามอนดาก็เต็มไปด้วยความกดดันในฐานะผู้นำใหม่ของวาคานด้า ซูริก็ต้องแบกรับความหวังและความเชื่อมั่นในตัวเอง ส่วนนาเกียเองก็ต้องรับความสูญเสียของอดีตคนรักไปให้ได้ ส่วนโอโคเยก็ต้องเป็นทัพหน้านำกองทัพโดรามิลาเจ ต่อสู้เพื่อปกป้องชาติและราชบัลลังก์เอาไว้ให้ได้ เป็นส่วนผสมหนังซูเปอร์ฮีโรพลังหญิงที่ส่วนตัวผู้เขียนมองว่าน่าสนใจและชอบมาก ๆ เรื่องหนึ่งเลยครับ',
            'info9': 'และพอหนังเลือกที่จะมูฟออนจากความสูญเสีย โดยมีจุดมุ่งหมายเพื่อเดินหน้าต่อไป โดยเฉพาะการต่อกรกับเนมอร์ การหยิบประเด็นเกี่ยวกับการเล่าเรื่องของวาคานด้า ในภาคนี้เราเลยจะได้เห็นซูริหยิบจับเทคโนโลยีล้ำ ๆ ให้ได้ทึ่ง รวมทั้งการตามหาไอรอนฮาร์ต ที่เป็นสาเหตุสำคัญของ Conflict ในหนังก็ยังคงถูกเล่าได้ออกมาสนุกสนาน แม้ว่าตัวหนังจะยาวมากถึง 161 นาที แต่ก็เรียกได้ว่าไม่ยาวไป ยังมีฉากแอ็กชันตามแบบฉบับให้ได้ดู อาจจะไม่ได้เน้นแอ็กชันตูมตามแบบแมน ๆ แต่ก็ต้องเรียกได้ว่าดุดันและยิ่งใหญ่ขึ้นจากภาคแรกมาก ๆ ส่วนงานด้าน CGI ที่ภาคแรกมีปัญหางานหยาบ พอมาภาคนี้ถือว่าทำออกมาได้ดีขึ้นนะครับ โดยเฉพาะฉากใต้น้ำเมืองทาโลคานที่ตื่นตาตื่นใจมาก คืออาจจะไม่ได้ถึงกับเนียนกริบเหมือน ‘Avatar 2’ ขนาดนั้น และบางจุดก็ยังแอบมีหลอกตาแบบจับได้บ้าง แต่ก็ถือว่าทำได้ออกมาสวยงาม เป็นซีจีหนัง Marvel ที่สอบผ่านท่ามกลางบรรดาหนังซีรีส์เฟส 4 ที่สอบตกมาหลายเรื่องแล้ว',
            'info10': 'แม้ว่าการผสานความหลากหลายและประเด็นอันซับซ้อนของตัวหนัง ทั้งเรื่องของการเมือง วัฒนธรรม ความเชื่อ ความรัก ความอาลัย ความหวงแหน ในภาคนี้จะทำและนำเสนอออกมาได้น่าสนใจและหนักแน่นไม่ต่างจากภาคแรกเลยแหละ แต่สิ่งที่เป็นข้อสังเกตก็คือการเล่าเรื่อง การตัดต่อ และบางซีนที่เล่าแบบติด ๆ ขัด ๆ ไหลลื่นน้อยกว่าภาคแรกอยู่พอสมควร บางฉากที่เหมือนใส่มาเพราะจำเป็นต้องโชว์ของ และบาดแผลนั้นก็ไปเห็นชัดเอาตอนฉากแอ็กชัน และฉากสู้รบตอนช่วงท้ายเรื่อง อีกจุดเด่นที่ผู้เขียนรู้สึกก็คือ แบล็กแพนเธอร์คนใหม่ที่ปรากฏตัวครั้งแรกในภาคนี้ ยังไม่ได้มีบารมีเทียบเท่ากับที่โบสแมนเป็นนะครับ แม้ว่าเราจะยังมูฟออนจาก แบล็ก แพนเธอร์ เวอร์ชันโบสแมนไม่ได้ก็เถอะ แต่ถ้ามองว่านี่คือ แบล็ก แพนเธอร์ รุ่นใหม่ แบบเดียวกับฮีโรวัยหนุ่มสาวหลายคนที่เปิดตัวไปแล้วในเฟส 4 ก็ถือว่าเข้าใจได้ว่า ได้เวลามูฟออนแล้วสินะ',
            'info11' : 'โดยรวมแล้ว ‘Black Panther: Wakanda Forever แบล็ค แพนเธอร์: วาคานด้าจงเจริญ’ สำหรับผู้เขียน มันเป็นหนังแห่งการมูฟออนจริง ๆ ครับ นอกจากจะเป็นหนังที่สร้างขึ้นเพื่อระลึกถึงโบสแมนก็จริง แต่ไม่ได้เป็นหนังที่ชวนให้เราดราม่าเจ็บตับ มันอาจจะไม่ได้เป็นหนังที่คอยอัดเซอร์ไพรส์ชวนให้กรี๊ด ตรงกันข้าม มันเป็นหนัง Marvel ที่ลอยอวลไปด้วยความโหยหาอาลัย แต่ก็ยังคงพยายามเติมความหวังให้กับคนดู เป็นหนังฮีโรที่ขับเคลื่อนด้วยพลังแห่งความหวัง และพลังแห่งสตรีนิยมที่วางอย่างถูกที่ถูกทาง โดดเด่น เข้มแข็ง และอ่อนโยนในเวลาเดียวกัน เป็นการผ่องถ่ายจากฮีโรผู้ช้ายผู้ชายในภาคแรก สู่ฮีโรพลังหญิงอย่างเต็มตัว อาจไม่ได้สมบูรณ์แบบเท่าภาคแรก แต่เป็นหนังที่รู้จุดเด่นของตัวเอง และสามารถดึงเอามาใช้ในภาคนี้ได้อย่างครบถ้วน สืบสานและต่อยอดไปสู่เรื่องราวใหม่ ๆ อีกทั้งยังเป็นหนังปิดเฟส 4 ได้อย่างสมเกียรติ จนเรียกว่านี่คือหนัง Marvel ที่น่าจะติดอันดับต้น ๆ ของหนังและซีรีส์ในเฟส 4 เลยก็ว่าได้',
            'poster': 'POSTER2.png',  # Fallback image if video is unavailable
            'video': 'blackpanter.mp4',  # Background video for Black Panther
            'actor_image': 'blackpanther_info.jpg',
            'actor_image2': 'blackpanther_info2.jpg',
            'actor_image3': 'blackpanther_info3.jpg',
            'actor_image4': 'blackpanther_info4.jpg',
            'actor_image5': 'blackpanther_info5.jpg',
            'actor_image6': 'blackpanther_info6.jpg',
            'actor_image7': 'blackpanther_info7.jpg',
            'actor_image8': 'blackpanther_info8.jpg',
            'actor_image9': 'blackpanther_info9.jpg',
            'actor_image10': 'blackpanther_info10.jpg',
            'actor_image11': 'blackpanther_info11.jpg',
            'actors': [
                {'name': 'Chadwick Boseman', 'image': 'cha.jpg'},
                {'name': 'Michael B. Jordan', 'image': 'micchal.jpg'},
                {'name': 'Lupita Nyong', 'image': 'lu.jpg'},
                {'name': 'Danai Gurira', 'image': 'da.jpg'},
                {'name': 'Martin Freeman', 'image': 'ma.jpg'},
                {'name': 'Daniel Kaluuya', 'image': 'dan.jpg'},
                {'name': 'Letitia Wright', 'image': 'let.jpg'},
                {'name': 'Winston Duke', 'image': 'win.jpg'},
                {'name': 'Sterling K. Brown', 'image': 'ster.jpg'},
                {'name': 'Angela Bassett', 'image': 'an.jpg'},
            ]
        },
        3: {
            'title': 'Moonfall',
            'description': 'ไบรอัน ฮาร์เปอร์ (นำแสดงโดย แพทริก วิลสัน Patrick Wilson) อดีตนักบินอวกาศที่เคยบาดหมางกับนาซาจำต้องกลับมาร่วมภารกิจครั้งใหม่กับ โจซินดา ฟาวล์ (นำแสดงโดย ฮัลลี เบอร์รี Halle Berry) อดีตเพื่อนร่วมงานของเขาอีกครั้งหลังจากเคซี เฮาส์แมน (นำแสดงโดยจอห์น แบรดลีย์ John Bradley) หนุ่มเนิร์ดที่ค้นพบว่าดวงจันทร์เปลี่ยนเส้นทางโคจรและกำลังจะพุ่งชนโลกนำความวิบัติมาสู่ทุกชีวิต ชะตากรรมของโลกจึงอยู่ในมือของพวกเขา',
            'director': 'Roland Emmerich',
            'release_date': '2022-02-04',
            'genre': 'Science Fiction, Action',
            'info' : 'ดูเหมือนว่าชะตากรรมล่าสุดของหนังดวงจันทร์ถล่มโลกในอเมริกาสำหรับ Moonfall นั้นจะเข้าขั้นย่ำแย่ทั้งรายได้และคำวิจารณ์ เนื่องจากทำรายได้เปิดตัวไปเพียงน้อยนิด 10 ล้านเหรียญฯ จากต้นทุน 140 ล้านเหรียญฯ ถึงอย่างนั้นก็คงต้องบอกว่าแฟนหนังวันโลกแตกก็ไม่ควรพลาดอยู่ดี',
            'info2' : 'จะว่าไป “โจทย์” ของหนัง เรียกได้ว่า มีจุดขายที่น่าสนใจและฟังดูน่าสนุกเป็นอย่างมาก เพราะถ้าสมมติว่าวันหนึ่งพระจันทร์ที่เราแหงนหน้ามองกันอยู่ทุกวี่วัน จะเกิดตกลงมายังโลกมนุษย์ และระหว่างนั้นเองเมื่อวงโคจรของดวงจันทร์ที่มีการเปลี่ยนแปลงไป จะนำมาซึ่งปรากฏการณ์ธรรมชาติที่วิปริตผิดเพี้ยนไปจากเดิมที่ละเล็กทีละน้อย มิหนำซ้ำหนังยังสนับสนุนทฤษฎีสมคบคิดเข้าไปอีกว่า จริงๆแล้วดวงจันทร์นั้นเป็นสิ่งที่เอเลี่ยนสร้างขึ้น ไม่ได้เป็นดาวเคราะห์ที่เกิดขึ้นเองตามธรรมชาติ ยิ่งแล้วเป็นประเด็นที่น่าสนใจเข้าไปใหญ่',
            'info3' : 'น่าเสียดายจังที่หนังแนวทฤษฎีสมคบคิด กับผู้กำกับจอมทำลายล้างอย่างโรแลนด์ เอ็มเมอริช จะดูไม่ได้ให้ความสำคัญกับความลึกลับของปมประเด็นดังกล่าว มากเสียไปกว่าการมัวสาละวนอยู่กับตัวละครเอกของเรื่อง ที่ดูเหมือนจะมีปมกันเรื่องครอบครัวแตกแยกกันแทบทุกบ้าน ทางบ้านไบรอัน ฮาร์เปอร์ (แพทริก วิลสัน) ได้แยกทางกับภรรยา ลูกชายกลายเป็นเด็กมีปัญหา ส่วนผู้เป็นพ่อเองก็ดูกลายเป็นคนเบิร์นเอาท์ในชีวิตไปซะดื้อๆ ภายหลังจากความล้มเหลวของการปฏิบัติภารกิจนอกโลกเมื่อนานมาแล้ว ในขณะที่บ้านของ โจ ฟาวเลอร์ (ฮัลลี เบอร์รี) เธอเป็นคุณแม่ที่ต้องทำงานกับองค์การนาซ่าชนิดที่ไม่มีเวลาเลี้ยงดูลูกชาย ตัวน้อยในขณะที่ผู้เป็นพ่อก็ทำงานอยู่ในกระทรวงกลาโหมเป็นข้าราชการระดับสูงที่ดูยุ่งกับตำแหน่งไม่แพ้กัน ท่ามกลางดราม่าความสัมพันธ์ของตัวละครนี่เอง ที่ทำให้คนดูต้องคอยเอาใจช่วยกันอยู่ตลอดเวลา ว่าจะมี “สมาชิกในครอบครัว” ของบ้านไหนเกิดเอาตัวไม่รอดจากภัยพิบัติในครั้งนี้บ้าง',
            'info4' :'สิ่งที่ค่อนข้างขาดหายไปใน Moonfall คือฉากประเทศภัยพิบัติครั้งใหญ่ที่เกิดขึ้นบนโลกมนุษย์และทำให้ประชาชนคนรากหญ้าต้องหนีตายกันอย่างจ้าละหวั่นแบบที่เราเคยได้เห็นใน The Day after Tomorrow หรือ 2012 แต่ฉากใหญ่ๆซีจีล้นๆส่วนมากใน Moonfall จะเป็นฉากที่กลุ่มตัวเอกต้องไปปฏิบัติภารกิจนอกโลกเสียมากกว่า ส่วนฉากที่สมาชิกครอบครัวที่ยังต้องกระเสือกกระสนเอาตัวรอดบนโลก ก็กลายเป็นฉากโชว์สมรรถนะรถของสปอนเซอร์ภาพยนตร์ไปซะ',
            'info5': 'อย่างไรก็ตาม เมื่อหนังตั้งใจจะโม้ชนิดสุดลิ่มทิ่มประตู ในช่วงองก์สุดท้ายของเรื่อง Moonfall ก็ไม่ทำให้คนดูต้องผิดหวัง เพราะคำเฉลยเบื้องหลังที่มาที่ไปของดวงจันทร์นั้น เรียกได้ว่าถ้าไม่ขำพรวดจนต้องทึ้งหัวตัวเอง ก็อาจจะเกิดอาการเหวอว่าพี่แกจะเอาแบบนี้เลยใช่ไหมนะ',
            'info6': 'ตัวหนังจะเล่าเรื่องนักบินอวกาศที่ต้องหาทางยับยั้งดวงจันทร์ซึ่งจู่ๆ ก็หลุดวงโคจรและเตรียมพุ่งเข้าชนโลก ซึ่งคนในเรื่องมีเวลารับมือไม่ถึง 3 สัปดาห์ก่อนความฉิบหายระดับล้างบางมนุษยชาติจะมาเยือน ซึ่งแน่นอนว่ากางมาแบบนี้คนดูหนังโลกถล่มแผ่นดินทลายมานับไม่ถ้วนก็ย่อมมองเห็นตอนจบอยู่แล้วว่ามันจะมาอีท่าไหน และตัวผู้กำกับเองก็คล้ายจะรู้ตัวเช่นกัน ดังนั้นแล้วก็ปรุงรสระหว่างทางจึงเป็นเรื่องสำคัญ หากรสชาติไม่เด่นหนังก็เตรียมจองศาลาได้เลย',
            'info7': 'โดยส่วนตัวแล้วผมว่ารสชาติหนังมีความจัดจ้านแบบเฉพาะตัวกว่าที่คิด ผมเดาได้เลยว่าหลายคนจะไม่ชอบรสนี้ เพราะมันอาจจะสดใหม่และแปลกประหลาดเกินกว่าจะรับได้ แต่กับสิ่งมีชีวิตที่มีความ Geek ในตัวชอบทฤษฎีวิทยาศาสตร์ฟุ้งๆ ลอยๆ มีความเป็น Fiction มากกว่า Fact แบบผมกับอีกหลายๆ คน ก็บอกได้เลยว่าโดนใจพอสมควร เพราะคงมีผู้กำกับไม่กี่คนที่เอาทุนหนาๆ มาลงกับหนังสนองความ Geek แบบหลุดโลกอย่างนี้',
            'info8': 'อันที่จริงถ้าผู้ชมเคยรู้จักทฤษฎี Dyson Sphere มาก่อนหน้าบ้างก็อาจจะอินมากขึ้น แต่ผมซึ่งไม่เคยอ่านทว่าก็ผ่านการเล่นเกมที่อิงทฤษฎีแหวกๆ มาเยอะ สามารถรับกับมันได้ง่ายมากๆ แค่อาจจะเหวอหน่อยที่เห็นหนังฮอลลิวูดเล่นกับประเด็นหลุดๆ แบบนี้ แต่นั่นแหละที่เป็นองค์ประกอบสุดสลักสำคัญที่ทำให้ผมรักมันแบบเกลียดไม่ลง แม้จะรู้ดีแก่ใจว่านี่ไม่ใช่หนังที่ถึงขั้นดีเด่อะไร',
            'info9': 'แน่นอนว่าในหนังแบบนี้พาร์ทดราม่าตัวละครเป็นอะไรที่สุ่มเสี่ยงต่อความน่ารำคาญอย่างมาก เรื่องนี้ก็เกือบจะเป็น แต่เอมเมอร์ริชสามารถดัดแปลงซีนเหล่านี้มาใช้กับหนังของตัวเองได้เป็นอย่างดี อย่างน้อยถึงไม่ได้อินอะไรนักแต่เราก็ไม่รู้สึกว่ารำคาญมัน วิธีการก็คือ ตัดบทพูดให้น้อยลง แล้วหยิบตัวละครเหล่านั้นไปเจอกับสิ่งที่อยากนำเสนอให้มากที่สุด นั่นก็คือภาพของภัยพิบัติที่เกิดขึ้นบนโลก',
            'info10': 'ผมไม่แน่ใจนักว่าเขาใช้ทีม CG กี่ทีมในการทำหนังเรื่องนี้ แต่มันเห็นได้ชัดถึงงานที่ละเอียดไม่เท่ากัน บางซีนชวนว้าว บางซีนก็ดูลอยแบบไม่เกรงใจ พูดได้ว่าตอนหนัง 2012 ฉากหายนะในภาพรวมดูเนียนตากว่านี้ ทว่าจุดที่ Moonfall ทำได้แตกต่างและยอดเยี่ยมมากๆ ก็คือวิช่วลที่มีความเป็นไซไฟแฟนตาซีแฝงอยู่ อย่างในตัวอย่างที่เราจะเห็นซีนคนวิ่งหนีโดยที่ฉากหลังก็คือมีทั้งพายุหิมะ แผ่นดินไหว อุกกาบาตตกเป็นฝน เศษหินและดินกำลังลอยขึ้นฟ้าเพราะแรงดึงดูดจากดวงจันทร์ขนาดเบิ้มๆ ซึ่งกำลังลอยไถชั้นบรรยากาศโลกตามมาไม่ไกล ทั้งหมดทั้งมวลถูกอัดอยู่ในซีนเดียว มันเป็นสิ่งที่ไม่ค่อยเห็นในหนังภัยพิบัติเรื่องไหนๆ ซึ่งผมก็ดันบวกคะแนนพิศวาสในจุดนี้ไปอีก',
            'info11' : 'Moonfall เป็นหนังที่องค์ประกอบดูไม่สมประกอบสักอย่าง พลอตโฮล การเดินเรื่องตะกุกตะกักตัดไปตัดมา นักแสดงเล่นแข็ง บทไม่เอาอ่าว แต่มันคือหนังของเอมเมอร์ริชที่ผมชอบที่สุดในช่วงหลัง ชอบแบบไม่มีทางเกลียดมันได้ เพราะในปัจจุบันวงการฮอลลิวูดต้องการหนังฟุ้งๆ เวียร์ดๆ หลุดๆ แบบนี้่ หนังที่พูดถึงทฤษฎีวิทยาศาสตร์แบบรวดเร็วและไหลไปเรื่อยโดยที่ไม่ต้องวกกลับมาหาช่องอุดรอยโหว่หรือคอยอธิบายซ้ำๆ ซากๆ ให้คนดูเข้าใจ มันคือความเอาแต่ใจว่า “ก็ตูจะเอาแบบนี้ เข้าใจแค่นี้ก็พอ มันจะเกิดขึ้นตามนี้นี่แหละ” Moonfall เป็นแบบที่ว่ามาและผมก็โคตรซื้อมันเลย',
            'actor_image': 'moonfall_info1.jpg',
            'actor_image2': 'moonfall_info2.jpg',
            'actor_image3': 'moonfall_info3.jpg',
            'actor_image4': 'moonfall_info4.jpg',
            'actor_image5': 'moonfall_info5.jpg',
            'actor_image6': 'moonfall_info6.jpg',
            'actor_image7': 'moonfall_info7.jpg',
            'actor_image8': 'moonfall_info8.jpg',
            'actor_image9': 'moonfall_info9.jpg',
            'actor_image10': 'moonfall_info10.jpg',
            'actor_image11': 'moonfall_info11.jpg',
            'poster': 'POSTER3.png',
            'video': 'moonfall.mp4',
            'actors': [
                {'name': 'Halle Berry', 'image': 'ha.jpg'},
                {'name': 'Patrick Wilson', 'image': 'pa.jpg'},
                {'name': 'John Bradley', 'image': 'jon.jpg'},
                {'name': 'Donald Sutherland', 'image': 'do.jpg'},
                {'name': 'Michael Peña', 'image': 'pen.jpg'},
                {'name': 'Charlie Plummer', 'image': 'char.jpg'},
                {'name': 'Kelly Yu', 'image': 'kel.jpg'},
                {'name': 'Max Mauff', 'image': 'max.jpg'},
                {'name': 'Elyes Gabel', 'image': 'el.jpg'},
                {'name': 'Catherine Keener', 'image': 'cat.jpg'},
            ]
        },
        4: {
            'title': 'Titanic',
            'description': 'เป็นภาพยนตร์มหากาพย์โรแมนติก-ภัยพิบัติที่ออกฉายในปี 1997 กำกับโดย James Cameron และเขียนบทโดย Cameron และ Rose DeWitt Bukater ภาพยนตร์เรื่องนี้ติดตาม Rose DeWitt Bukater (รับบทโดย Kate Winslet) หญิงสาวชนชั้นสูงที่ไม่พอใจกับชีวิตที่ถูกกำหนดไว้ และ Jack Dawson (รับบทโดย Leonardo DiCaprio) ช่างวาดรูปหนุ่มผู้ยากไร้ พวกเขาตกหลุมรักกันบนเรือ RMS Titanic ในระหว่างการเดินทางครั้งแรกของเรือ',
            'director': 'James Cameron',
            'release_date': '1997-12-19',
            'genre': 'Drama, Romance',
            'info' : 'เมื่อมหากาพย์ภาพยนตร์โรแมนติกดราม่าเรื่อง ไททานิค (Titanic) ของเจมส์ คาเมรอนออกฉายในปี 1997(2540) มันกลายเป็นปรากฏการณ์ทันที ดึงดูดผู้ชมทั่วโลกด้วยการเล่าเรื่องที่ชวนหลงใหล งานภาพอันน่าทึ่ง และเรื่องราวความรักที่น่าเศร้า แม้เวลาจะผ่านมาหลายปี ภาพยนตร์เรื่องนี้ก็ยังคงเป็นสถานที่พิเศษในประวัติศาสตร์ภาพยนตร์ โดยเป็นเครื่องพิสูจน์ถึงพลังของการเล่าเรื่องและจิตวิญญาณของมนุษย์',
            'info2' : 'ฉากหลังของเรื่องคือการเดินทางครั้งแรกที่แสนจะอาภัพของเรือ RMS Titanic ในปี 1912(2455) โดยเล่าผ่านการตามติดชีวิตของคนหนุ่มสาวสองคนจากชนชั้นทางสังคมที่แตกต่างกัน ซึ่งมาคลิกกันท่ามกลางความมั่งคั่งบนเรือสำราญและความหายนะที่กำลังจะเกิดขึ้นตามมา แจ็ก ดอว์สัน (ลีโอนาร์โด ดิคาปริโอ) ศิลปินนักวาดไส้แห้งผู้รักอิสระ และโรส เดอวิตต์ บูเคเตอร์ (เคต วินสเล็ต) หญิงสาวที่ติดหล่มอยู่ในชนชั้นสูงที่ไร้ซึ่งอิสระและความเป็นตัวเอง ก่อตัวเป็นสายสัมพันธ์ที่ไม่ธรรมดาที่ท้าทายบรรทัดฐานทางสังคม',
            'info3' : 'แตกต่างอย่างแท้จริงและตอกย้ำความยิ่งใหญ่ของมันคือ ความสามารถในการพาผู้ชมย้อนกลับไปในยุคนั้นด้วยความสมจริงอย่างน่าอัศจรรย์ ความใส่ใจในรายละเอียดของเจมส์ คาเมรอน ทำให้มั่นใจได้ว่าทุกเฟรมจะทำให้เรารู้สึกดื่มด่ำไปกับความยิ่งใหญ่และโศกนาฏกรรมของเรือไททานิค การสร้างเรือจำลองที่ดูอลังการงานสร้าง ไปจนถึงเครื่องแต่งกายที่แพรวพราวและการออกแบบงานสร้างที่พิถีพิถัน ความงดงามทางภาพของภาพยนตร์เรื่องนี้ช่างดูน่าตื่นตาตื่นใจเป็นอย่างมาก การที่กลับมาดูอีกครั้งในรอบหลายๆ ปี ยังคงทึ่งกับงานภาพของเรื่องนี้เป็นอย่างมาก ดูเนี๊ยบจริงๆ',
            'info4' :'หัวใจของเรื่องราวคือตัวละครหลักสองคน แจ็คและโรส ซึ่งเป็นตัวแทนของสัญลักษณ์ของการปลดปล่อยและการกบฏต่อข้อจำกัดทางสังคม แจ็ค ศิลปินอิสระที่มีภูมิหลังต่ำต้อย มีจิตวิญญาณแห่งอิสระและการผจญภัย เขาท้าทายโครงสร้างทางสังคมที่เข้มงวดในยุคนั้นและกระตุ้นให้โรสหลุดพ้นจากกรงทองของเธอ ในทางกลับกัน โรสที่เปรียบเสมือนสัญลักษณ์ของการดำรงอยู่อย่างทรมานของชนชั้นสูง ติดหล่มกับความคาดหวังและการแต่งงานที่ปราศจากความรัก ด้วยความสัมพันธ์ของทั้งคู่ กลายเป็นตัวเร่งในการปลดปล่อยพันธนาการซึ่งกันและกัน',
            'info5': 'ตัวละครของแจ็คเปรียบเสมือนคำเปรียบเปรยของผู้ด้อยโอกาสและผู้ที่กล้าที่จะฝันไกลเกินเอื้อม ความจริงใจ ความซื่อสัตย์ และความรักที่แท้จริงของเขาที่มีต่อโรส ท้าทายแนวคิดเรื่องสถานะทางสังคม โดยเน้นย้ำถึงความสำคัญของความเห็นอกเห็นใจและความถูกต้องเหนือทรัพย์สินทางวัตถุ ดั่งที่แจ็คพูดบนโต๊ะอาหารกับบรรดาเหล่าเศรษฐีได้ตระหนักถึงการใช้ชีวิตให้คุ้ม เพื่อให้แต่ละวันนั้นคุ้มค่า – to make each day count',
            'info6': 'ในทางกลับกัน โรสเป็นตัวแทนของพลังแห่งการเปลี่ยนแปลงของความรัก และความลุกขึ้นสู้ในการต่อต้านบรรทัดฐานทางสังคม การเดินทางของเธอจากหญิงสาวที่ติดกับดักความคาดหวังของแม่ ไปสู่บุคคลที่มีอิสรเสรีที่เต็มใจต่อสู้เพื่อความสุขของตัวเองนั้น สะท้อนความรู้สึกได้อย่างลึกซึ้ง จากการคลุกคลีกับแจ็ค โรสค้นพบตัวตนที่แท้จริงของเธอ ใช้ความกล้าหาญที่จะไล่ตามความปรารถนาของตัวเอง และหลุดพ้นจากโซ่ตรวนของการเลี้ยงดูท่ามกลางสิทธิพิเศษของเธอ',
            'info7': 'นอกเหนือจากตัวละครที่ดึงดูดใจแล้ว ภาพยนตร์ยังเจาะลึกประเด็นของความรัก การเสียสละ และจิตวิญญาณของมนุษย์ที่ไม่ย่อท้อ ภาพยนตร์เรื่องนี้แสดงให้เห็นความแตกต่างอย่างสิ้นเชิง ระหว่างความหรูหราฟุ่มเฟือยของเรือกับความเป็นจริงอันโหดร้ายของชีวิตผู้ที่ด้อยโอกาส มันแสดงภาพโศกนาฏกรรมของการจมของเรือไททานิคได้อย่างเจ็บปวด แสดงให้เห็นสิ่งที่แท้จริงของภัยพิบัติและผลกระทบต่อชีวิตของผู้โดยสาร',
            'info8': 'การแสดงในของนักแสดงนั้นก็โดดเด่นไม่แพ้กัน โดยลีโอนาร์โด ดิคาปริโอในวัยละอ่อนและเคต วินสเล็ตหญิงสาวที่ดูสง่า แสดงบทแจ็คกับโรสได้อย่างน่าหลงใหล เคมีบนหน้าจอของพวกเขาดูเข้ากันได้ดีมาก อารมณ์ออกมาแบบดิบๆ แต่ดูน่าเชื่อถือ ดึงให้เราเข้าสู่เรื่องราวความรักของพวกเขาและทำให้โศกนาฏกรรมยิ่งบีบคั้นหัวใจมากขึ้นไปอีก',
            'info9': 'ในด้านเนื้อเรื่อง Titanic เป็นหนังรักเรื่องหนึ่งที่เล่าถึงความรักระหว่างชนชั้นวรรณะ Rose DeWitt Bukater (รับบทโดย Kate Winslet) เป็นผู้หญิงชนชั้นสูงที่ถูกหมายหมั่นไว้แล้ว Jack Dawson (รับบทโดย Leonardo DiCaprio) ชายหนุ่มยาจน ผู้ทะเยอทะยานและฝันไกล ทั้งสองคนได้พบรักกันบนเรือ Titanic ล้ำนี้',
            'info10': 'รียกได้ว่าบทหนัง Titanic คือ ละครรักน้ำเน่า ก็ว่าได้ ดอกฟ้ากับหมาวัดได้พบรักกัน ทั้งสองได้มีความสัมพันธ์อันไม่ควรต่อกัน ในหลายฉากที่ James Cameron ใส่ลงไปใน Titanic นั้น แม้จะดูน้ำเน่า แต่มันทำให้ความสัมพันธ์ของทั้ง Jack และ Rose แข็งแรงและทำให้คนดูอินได้ไม่ยาก',
            'info11' : 'บทสนทนา สถานการณ์ เลิฟซีนที่เกิดขึ้น จะพาให้คนดูรู้สึกอินหนักมากในฉากสุดท้าย แม้ในด้านการสร้างความสัมพันธ์ระหว่างตัวละครจะทำได้ดีมากแค่ไหน แต่คงต้องบอกว่า หนังเรื่องนี้ไม่ใช่ทุกคนที่จะชอบ ดังนั้นถ้าเกิดคุณเป็นสายหนังโรแมนติกหนังเรื่อง Titanic คือหนังที่คุณควรหามาดู',
            'poster': 'POSTER4.png',
            'video': 'titanic.mp4',
            'actor_image': 'titanic_info.png',
            'actor_image2': 'titanic_info2.png',
            'actor_image3': 'titanic_info3.png',
            'actor_image4': 'titanic_info4.png',
            'actor_image5': 'titanic_info5.png',
            'actor_image6': 'titanic_info6.png',
            'actor_image7': 'titanic_info7.png',
            'actor_image8': 'titanic_info8.png',
            'actor_image9': 'titanic_info9.png',
            'actor_image10': 'titanic_info10.png',
            'actor_image11': 'titanic_info11.png',
            'actors': [
                {'name': 'Leonardo DiCaprio', 'image': 'leo.jpg'},
                {'name': 'Kate Winslet', 'image': 'kate.jpg'},
                {'name': 'Billy Zane', 'image': 'billy.jpg'},
                {'name': 'Kathy Bates', 'image': 'katy.jpg'},
                {'name': 'Frances Fisher', 'image': 'fran.jpg'},
                {'name': 'Gloria Stuart', 'image': 'glo.png'},
                {'name': 'Bill Paxton', 'image': 'pax.jpg'},
                {'name': 'Bernard Hill', 'image': 'actor.jpg'},
                {'name': 'David Warner', 'image': 'david.jpg'},
                {'name': 'Victor Garber', 'image': 'victor.jpg'},
            ]
        },
        5: {
            'title': 'Friday the 13th',
            'description': 'ฆาตกรเจสัน วอร์ฮีส์ ปรากฎตัวครั้งแรกในภาพยนตร์เรื่อง Friday the 13th ในปี 1980 และยังมีภาคต่ออีก 11 ภาค เจสัน วอฮีร์ เป็นเด็กพิการ หน้าตาน่าเกลียด โดนเพื่อนแกล้งจนจมน้ำตาย โดยศุกร์ 13 เกือบทุกภาค ก็จะพยายามเล่าเรื่องเหล่านี้อย่างละนิดละหน่อยให้คนดูได้รู้เบื้องหลังของเจสันไปเรื่อยๆ เช่นภาคแรก แม่ของเจสันนั่นเอง ที่ออกฆ่าคน พอมาภาคสองเจสันก็มีตัวตนจริงออกฆ่าคนบ้าง ไปจนถึงภาคสาม ภาคสี่และอีกหลายๆ ภาค จุดเด่นของเจสันที่คนโลกต่างทึ่งไปตามๆ กัน คือ ความเป็นอมตะของเค้า(เหนียว) เจสันตายแล้วก็ต้องฟื้น ทำยังไงก็ไม่ตายชะที เป็นตัวละครที่หนึ่งที่ติดตาคนดูมากที่สุดเลยก็ว่าได้ชึ่งสมัยนั้นถือว่าสยองมาก สมัยนั้นคอหนังสยองจะชอบมากเพราะเจสันจะฆ่าไม่เลือกจนตอนนี้ออกมาจนภาค10 (X) มีทั้งตอนเป็นคน และผี และปีศาจ หรือที่สุดๆ คือเจสัน X ที่กลายเป็นเครื่องจักรครึ่งอสูรกาย',
            'director': 'Sean S. Cunningham',
            'release_date': '1980-05-09',
            'genre': 'Horror, Thriller',
            'info' : 'ตัวละครฆาตกรสุดโหดเยือกเย็น และ โหดเหี้ยมที่สุดระดับตำนานกำลังจะกลับมา พร้อมกับความโหด ระทึกมากกว่าเดิม ซึ่งเขาจะมาสาดความโหดอีกครั้ง และกลับมาไล่ล่าผู้คน ใน The Friday the 13th โดยชื่อของเขาก็คือ เจสัน วอร์ฮีส์!!',
            'info2' : 'เรื่องราว : เกี่ยวกับ เจสัน วอฮีร์ ซึ่งเป็นเด็กพิการ หน้าตาน่าเกลียด และโดนเพื่อนแกล้งจนจมน้ำตาย ทำให้แม่ของเจสันซึ่งเป็นที่ปรึกษาของค่ายคริสตัลเลค จะมาแก้แค้นให้กับเจสันลูกชายของเธอที่เสียชีวิตเมื่อหลายปีก่อน เลยตามไล่ล่าทุกคนในค่ายแห่งนี้ ในที่สุดเธอก็ตายด้วยน้ำมือของเด็กผู้หญิงคนหนึ่ง และจากนั้นเจสันลูกชายของเธอ ได้ฟื้นขึ้นมาจากความตาย เขาพร้อมจะฆ่าทุกคนที่มาใน "ค่ายคริสตัลเลค" แห่งนี้ หลายปีต่อมาได้มีวัยรุ่นกลุ่มหนึ่งเข้ามาในค่ายแห่งนี้เพื่อมาพักแคมป์ ทำให้เจสันตามฆ่าทีละคน แต่มีหนึ่งในนั้นที่เจสันไม่ฆ่าเพราะเธอหน้าเหมือนแม่ของเขา ซึ่งเธอชื่อว่า "วิทนีย์ มิลเลอร์" ซึ่งเจสันใช้วิธีจับตัวเธอไว้แทน',
            'info3' : 'หลังจากนั้นไม่นาน ก็ได้มีวัยรุ่นอีกกลุ่ม ซึ่งไปพักที่เคบินริมทะเลสาป ในช่วงวันหยุดสุดสัปดาห์ของพวกเขา และ ยังมีชายหนุ่มอีกคนเขาชื่อว่า เคลย์ มิลเลอร์ ซึ่งเขามาตามหาน้องสาวที่หายตัวไปเมื่อหลายวันก่อน แล้วพวกเขารู้หรือไม่ว่าที่นี่มันอันตรายแค่ไหน เมื่อความสนุกของพวกเขากำลังจะกลายเป็นฝันร้าย ที่พวกเขาไม่อยากจะพบเจอ',
            'info4' :'ฆาตกรสุดอำมหิต เชื่อว่าหลายคนคงเคยชมมาไม่มากก็น้อย กับภาพยนตร์ The Friday the 13th เรื่องนี้ รับลองเลยว่าไม่ผิดหวังจริง ๆ กับการรอคอยมานาน ตัวหนังยังทำให้คนตื่นเต้นได้ตลอดทั้งเรื่อง ถือว่ามีฉากให้ลุ้นเยอะพอสมควร ตัวหนังเล่าเรื่องราวของตัวละครได้อย่างสมบูรณ์แบบมาก และจุดเด่นอีกอย่าง ก็คือ ตัวละครอย่าง เจสัน วอร์ฮีส์ นี่แหละ เพราะเป็นตัวละครที่มีเอกลักษณ์มากเลย ก็คือ การฆ่าหลายรูปแบบ โดยไม่มีการพูดเลยแม้แต่คำเดียว ซึ่งมันดูน่าเกรงขามสุด ๆ',
            'info5': 'ส่วนฉากการไล่ล่านี่ รู้สึกลุ้นระทึกจริง ๆ มีฉากให้ตกใจเยอะมาก อีกอย่าง คือ หนังเรื่องนี้ไม่เหมาะสำหรับเด็กเท่าไหร่นัก เพราะตัวหนังมีฉากโหด ๆ เยอะมาก แถมยังมีฉาก18+ อีกด้วย ต้องขอย้ำว่าไม่เหมาะกับเด็ก',
            'info6': 'หนังเรื่องนี้ยังได้ ไมเคิล เบย์ มาเป็นผู้อำนวยการสร้างอีกด้วย ถือว่าเพิ่มเสน่ห์ให้กับตัวหนังได้ไม่น้อย ส่วนเนื้อเรื่องดูเข้มข้นมาก ตัวหนังผสมผสานเรื่องราวได้อย่างลงตัว แต่จุดที่น่าเสียดายนิด ๆ ก็คือตัวหนังเล่าเรื่องเร็วไปหน่อย แต่โดยรวมแล้วตัวหนังก็ทำออกมาดี สนุก ใช้ได้ และอีกอย่างที่ชอบจริง ๆ คือหนังเดายากมาก นี่น่าจะเป็นจุดเด่นของหนังเรื่องนี้เลยก็ว่าได้',
            'info7': 'ถึงแม้ว่าหนังเรื่องนี้อาจไม่ใช่ภาคต่อของ แฟรนไชส์เมื่อ 40 ปีก่อน แต่อย่างน้อยตัวหนังก็เล่าเรื่องราวไม่แพ้ต้นฉบับ เพราะนี่เป็นการรีบูต ยกเครื่องใหม่ทั้งหมด ถือว่าเป็นหนังสยองขวัญที่ยอดเยี่ยมที่สุดอีกเรื่อง และส่วนตัวหนังทำรายได้ไป 91 ล้านดอลลาร์ จากทุนสร้างแค่ 19 ล้านดอลลาร์เท่านั้น ถ้าเทียบกับทุนสร้างแล้ว ก็ถือว่าได้กำไรเยอะอยู่พอสมควร',
            'info8': 'ในแง่ของการกำกับและการเล่าเรื่อง ผู้กำกับสามารถสร้างบรรยากาศความน่ากลัวและกดดันได้อย่างมีประสิทธิภาพ ผ่านการใช้มุมกล้องและเสียงประกอบที่ชวนให้ผู้ชมตื่นเต้นตลอดเวลา สิ่งที่น่าสนใจคือการใช้ความเงียบในการสร้างบรรยากาศที่น่ากลัว แทนที่จะพึ่งพาเพียงแค่ฉากการปรากฏตัวของสิ่งเหนือธรรมชาติหรือฉากกระโดดตกใจ (jump scare) ทำให้ผู้ชมคาดเดาไม่ได้ว่าจะเกิดอะไรขึ้นในฉากต่อไป',
            'info9': 'นอกจากความน่ากลัวแล้ว หนังยังมีการพัฒนาตัวละครได้อย่างดีเยี่ยม โดยเฉพาะตัวเอกที่ต้องเผชิญหน้ากับความกลัวและสิ่งที่เหนือธรรมชาติ ความสัมพันธ์ระหว่างตัวละครถูกถ่ายทอดอย่างลึกซึ้ง ทำให้ผู้ชมเข้าใจแรงจูงใจและความเจ็บปวดที่ตัวละครต้องเผชิญ ทำให้ผู้ชมรู้สึกผูกพันและเห็นใจตัวละครมากยิ่งขึ้น',
            'info10': 'ในส่วนของรายได้ เมื่อเปรียบเทียบกับทุนสร้างแล้ว หนังเรื่องนี้ถือว่าเป็นความสำเร็จทางการเงินที่น่าประทับใจ การทำกำไรจากทุนสร้างเพียง 19 ล้านดอลลาร์ แต่กลับทำรายได้ทั่วโลกไปถึง 91 ล้านดอลลาร์ เป็นข้อพิสูจน์ว่าหนังสยองขวัญที่มีเนื้อหาดีและการผลิตที่ยอดเยี่ยมยังคงได้รับความนิยมจากผู้ชมอย่างต่อเนื่อง',
            'info11' : 'ในแง่ของฉากและการออกแบบโปรดักชั่น หนังทำได้ยอดเยี่ยมในการสร้างโลกของตัวเอง ทุกฉากถูกออกแบบมาอย่างละเอียดและมีบรรยากาศที่เข้ากับแนวหนังสยองขวัญ ไม่ว่าจะเป็นฉากบ้านเก่าในป่า หรือสถานที่ที่เต็มไปด้วยความลึกลับ ทั้งหมดนี้ช่วยสร้างความน่ากลัวและเพิ่มความตื่นเต้นในการรับชม',
            'poster': 'POSTER5.png',
            'video': '13friday.mp4',
            'actor_image': 'fri_info.jpg',
            'actor_image2': 'fri_info2.jpg',
            'actor_image3': 'fri_info3.jpg',
            'actor_image4': 'fri_info4.jpg',
            'actor_image5': 'fri_info5.jpg',
            'actor_image6': 'fri_info6.jpg',
            'actor_image7': 'fri_info7.jpg',
            'actor_image8': 'fri_info8.jpg',
            'actor_image9': 'fri_info9.jpg',
            'actor_image10': 'fri_info10.jpg',
            'actor_image11': 'fri_info11.jpg',
            'actors': [
                {'name': 'Betsy Palmer', 'image': 'betsy.jpg'},
                {'name': 'Adrienne King', 'image': 'adrienne.jpg'},
                {'name': 'Jeannine Taylor', 'image': 'harry.jpg'},
                {'name': 'Robbi Morgan', 'image': 'harry.jpg'},
                {'name': 'Kevin Bacon', 'image': 'harry.jpg'},
                {'name': 'Harry Crosby', 'image': 'harry.jpg'},
                {'name': 'Laurie Bartram', 'image': 'harry.jpg'},
                {'name': 'Mark Nelson', 'image': 'harry.jpg'},
                {'name': 'Renee Jones ', 'image': 'harry.jpg'},
                {'name': 'Peter Browning', 'image': 'harry.jpg'},
            ]
        },
        6: {
            'title': '9Sadtra',
            'description': 'หนังแนวไซไฟที่เล่าเรื่องการสำรวจอวกาศที่ห่างไกล',
            'director': 'Jane Doe',
            'release_date': '2023-08-15',
            'genre': 'Science Fiction, Drama',
            'info' : 'สำหรับคนที่กลัวความลวกเอาเผากินแบบงานไทย ๆ บอกเลยครับว่าหนังใช้เวลาสร้างกว่า 4 ปี ทีมงานทั้งไทยและเทศกว่าอีก 200 คน และทุนสร้างรวมกว่า 230 ล้านบาท คือแปลกใจเลยที่พี่ ๆ ปิดข่าวงานสร้างมาเงียบมาก แล้วมาตู้ม ช็อกเลยแบบนี้ ยิ่งกับชื่อค่ายอย่าง เอ็กฟอร์แมท ฟิล์มส์ ที่ไม่คุ้นหู แถมเปรยตัวว่าเป็น วิช่วลเอเจนซี่ ที่ไม่เคยทำงานแอนิเมชั่นขนาดยาวมาก่อน ก็ดูชวนให้ฉงนเหมือนกันว่าไปซุ่มงานตอนไหนมา จึงไม่แปลกถ้าจะไม่คุ้นชื่อทั้งผู้กำกับ คนเขียนบท คือทั้งเครดิตคุ้นคนเดียว คือ สุธี แสงเสรีชน ผู้ควบคุมเพลงในหนัง หรือก็คือ ครูไก่ แห่งบ้าน AF ที่เราคงคุ้นตาดีนั่นเอง ที่มาคุมงานออร์เคสตราเต็มวงได้อลังการมาก ๆ แต่เมื่อดูเนื้องานในส่วนอื่นนอกจากเพลงก็ต้องบอกว่าไม่ธรรมดาจริง ๆ ยิ่งเครดิตจบเราเห็นชื่อคนไทยเกือบ 100% เป็นคนทำ ยิ่งโคตรภูมิใจเลยครับ',
            'info2' : 'หนังเล่าเรื่อง อ๊อด (ไต้ฝุ่น KPN) ชายหนุ่มแห่งโพ้นทะเล ผู้ที่มีชีวิตวัยเยาว์แสนอาภัพ โชคดีได้ร่ำเรียนวิชามวยไทยที่สาบสูญไปกับครูมวยท่านหนึ่ง เมื่อเติบโตก็ต้องรับภารกิจอันยิ่งใหญ่ในการกอบกู้อาณาจักรรามเทพนครจากเผ่ายักษ์ โดยร่วมมือกับพลพรรคเพื่อนพ้องที่บังเอิญเจอกันระหว่างการเดินทาง ไม่ว่าจะเป็น เสี่ยวหลาน (โบว์ AF5) โจรสลัดอากาศชาวจีนหุ่นเช้ง วาตะ (มิวสิค AF4) ลิงทะโมนที่เป็นถึงเจ้าชายของนครวานรที่ถูกยักษ์ทำลาย รวมถึง อสูรสีชาด (ชัย ศิริชัย) ยักษ์สีแดงร่างใหญ่ใจดีผู้ได้ชื่อว่ายักษ์ทรยศ อ๊อดต้องนำศาสตราวุธในตำนานที่พ่อของเขาเสี่ยงชีวิตนำหนีออกมาก่อนเมืองจะถูกทำลาย นำกลับไปให้รัชทายาทของอาณาจักรรามเทพนครซึ่งถูกจับกุมไว้เพื่อใช้ในการกอบกู้อาณาจักร',
            'info3' : 'เนื้อเรื่องได้รับการช่วยแก้ไขโดย Bryan Edward Hill ที่ปรึกษาด้านการเล่าเรื่องจากฮอลลีวู้ด ที่ช่วยให้เนื้อหามีความเป็นสากล จึงไม่น่าแปลกใจที่หนังจสามารถตีตลาดต่างชาติได้สบาย เพราะวิธีเล่าเป็นสากล เมื่อนำเอกลักษณ์แบบไทยไปใส่มันก็เลยไม่ดูฝืนดูแปลกแยกนัก ทั้งพวกสถาปัตยกรรม หรือคัทซีนเล่าเรื่องในอดีตที่ใช้ภาพลายฉลุแบบหนังใหญ่มาทำก็ดูสวยดูเนียน ผ่านการคิดมาอย่างดี ถึงขนาดว่าตอนนี้หนังขายให้จีนได้แล้ว และกำลังจะขายให้ทางอเมริกาต่อด้วย นับเป็นโปรเจ็กต์มองใหญ่ของค่าย เอ็กฟอร์แมท ฟิล์มส์ และก้าวสำคัญของแอนิเมชั่นไทยเลยด้วยครับ',
            'info4' :'สิ่งที่ต้องชื่นชมนอกจากเล่าเรื่องที่แม่นจังหวะ กับฉากแอคชั่นที่คิดมาได้ละเอียด ตัวละครนำพาคนดูไปสู่ฉากใหญ่ ๆ  ได้ตื่นตาทั้งหมด ทั้งเกาะไกลโพ้นทะเล การต่อสู้กลางอากาศด้วยเรือเหาะจนผ่านหุบเหว หรือแม้แต่การสู้กับราชายักษ์ก็ปูมาได้อย่างตื่นเต้นมีหักมุมหลอกคนดูด้วย',
            'info5': 'สิ่งที่น่าชมมากอีกอย่างคือการ ดีไซน์เหล่าตัวละคร ทั้งภาพลักษณ์ภายนอกที่บอกเลยว่าโคตรเท่ เท่ยันตัวประกอบ มีพวกการแปลงโฉมอัปเกรดหรือแปลงร่างที่เท่มาก ๆ ด้วย คือต่อยอดไปพวกสินค้าอื่น ๆ ได้สบายมาก ทั้งฟิกเกอร์ เกมคอนโซล บอร์ดเกม หรืออะไรต่อมิอะไรอีกหลายอย่าง เพราะงานดีไซน์มันสากลและแข็งแรงมาก ๆ แม้แนวการทำโมเดลจะดูมีแรงบรรดาลใจจากแอนิเมชั่นฝรั่งอย่างพวก Star Wars มามากกว่าการผสมเอกลักษณ์ตะวันออกสไตล์ญี่ปุ่น แต่หนังก็ผสมกลืนทั้งสองแบบมาได้อย่างพิถีพิถันทีเดียว  นี่ยังควรนับเรื่องการออกแบบภาพภายนอกกับบุคลิกและเส้นเรื่องที่สอดคล้องกันเป็นหนึ่งอีก คือต้องยอมใจกับทีมงานเขาจริง ๆ ว่าทุ่มเทและคิดกันละเอียดมาก ๆ ไม่มีการดูถูกเอาเปรียบคนดูแน่นอน',
            'info6': 'ส่วนที่ควรปรับปรุง ไม่ใช่ว่าจะไม่มี ที่เห็นชัดมาก คือเสียงบรรยายในพวกฉากคัทซีนดูธรรมดา ไม่ชวนให้น่าติดตาม เสียงไร้อารมณ์พอสมควร ยังดีว่าไม่ใช่ส่วนหลักของการเล่าเรื่องไม่งั้นหนังคงไร้ชีวิตดูน่าเบื่อมาก ๆ ส่วนต่อมาคือแม้ดนตรีประกอบจะทำได้ดีงามมาตรฐานฮอลลีวู้ด แต่ทว่าเพลงประกอบของ วงสลอตแมชชีน ในเรื่องนี้ออกจะโดดไป เสียงแหลมเล็กของ เฟิร์ส นักร้องนำดูไม่ค่อยเข้ากับตัวเรื่อง ยิ่งการมิกซ์ใส่ในหนังก็ทอนพลังของเพลงลงไปอีก ก็ยังดีว่าในหนังใช้เพียงเพลง รุ้ง เข้ามาประกอบเพลงเดียวช่วงกลางเรื่องเท่านั้น',
            'info7': 'อาจด้วยเส้นเรื่องที่ชงมาแอคชั่นซึ่งทำได้ดีมาก เข้าใจเรื่องชัดเจน แต่ก็เสียดายส่วนดราม่าบางอย่างที่หนังไม่มีเวลาให้มันมากนักจนทำให้มันดูหลวม ๆ ลงไปอย่างเรื่องราวของ พรานทมิฬ ซึ่งเป็นตัวละครหนึ่งที่มีเสน่ห์มากเช่นกัน กับการตัดสรุปบางอย่างก็ให้เวลาน้อยไปจนดูเหมือนจบเรื่องง่ายเกินไป ทั้งที่จริงคิดละเอียด ๆ มันมีคำตอบดี ๆ อยู่ในเรื่องแล้วเพียงเวลาในการขยี้น้อยไปเท่านั้น',
            'info8': 'และสุดท้ายงานภาพแม้จะงามหยดแต่การสื่อในส่วนของอารมณ์โดยเฉพาะการใช้ดวงตานั้น เรียกว่ายังแข็ง ขาดชีวิตไปพอสมควร อยากให้เล่นกับดวงตาได้มากกว่านี้อย่างน้อยก็ประกายตาของตัวเอกที่น่าจะช่วยให้บางฉากไม่ดูเป็นผีเป็นวิญญาณได้อีกเยอะ และในส่วนของการแอนิเมทช่วงต่อสู้ที่ทำได้สุดยอดนั้น ก็มีบางฉากที่การเคลื่อนไหวไวจนดูหลุดดูไม่เข้าใจ บางช่วงมีอาการเหมือนเฟรมเรตไม่สูงพอทำให้ภาพดูกระตุก',
            'info9': 'ทั้งหมดนี้เป็นส่วนที่ล้วนพัฒนาแก้ไขต่อไปได้ทั้งสิ้น และพูดตามตรงถึงจะเห็นจุดผิดพลาดมากเพียงใด แต่ก็ขอยอมมองข้ามทั้งหมดจริง ๆ  เพราะสุดท้าย หนังมันสนุกมาก มันประทับใจมาก และมันเอาคนดูอยู่จริง ๆ ครับ คุณไม่จำเป็นต้องไปดูเพราะชอบหนังไทยเลยสำหรับเรื่องนี้ เพราะถ้าคุณชอบดูหนังสนุก ๆ มันก็เป็นเหตุผลที่มากพอแล้วที่คุณต้องดูหนังเรื่องนี้',
            'info10': 'สิ่งที่ทำให้หนังเรื่องนี้โดดเด่นและสามารถจับใจคนดูได้ คือการเล่าเรื่องที่มีความสมดุลระหว่างความสยองขวัญและความบันเทิง หนังไม่ได้เน้นแค่การสร้างความกลัวเพียงอย่างเดียว แต่ยังใส่ใจในรายละเอียดของการพัฒนาพล็อตและการสร้างความสัมพันธ์ระหว่างตัวละครที่ทำให้ผู้ชมรู้สึกอินกับเรื่องราวมากขึ้น ถึงแม้จะมีบางจุดที่อาจจะถูกมองว่าเป็นข้อบกพร่อง แต่โดยรวมแล้วหนังยังคงสามารถส่งมอบประสบการณ์ที่เต็มเปี่ยมไปด้วยความตื่นเต้นและความสนุกได้อย่างยอดเยี่ยม',
            'info11' : 'สำหรับแฟนหนังสยองขวัญหรือคนที่มองหาหนังที่มีความเข้มข้นและสนุกสนาน หนังเรื่องนี้ถือว่าเป็นหนึ่งในตัวเลือกที่ไม่ควรพลาด ด้วยเนื้อเรื่องที่น่าติดตาม บรรยากาศที่สร้างความกดดัน และการแสดงที่เต็มไปด้วยพลัง ทุกองค์ประกอบถูกผสมผสานเข้าด้วยกันอย่างลงตัว ทำให้หนังเรื่องนี้มีความสามารถในการดึงผู้ชมให้ติดตามตั้งแต่ต้นจนจบโดยไม่สามารถละสายตาได้',
            'poster': 'POSTER6.png',
            'video': '99.mp4',
            'actor_image': '9_info.jpg',
            'actor_image2': '9_info2.jpg',
            'actor_image3': '9_info3.jpg',
            'actor_image4': '9_info4.jpg',
            'actor_image5': '9_info5.jpg',
            'actor_image6': '9_info6.jpg',
            'actor_image7': '9_info7.jpg',
            'actor_image8': '9_info8.jpg',
            'actor_image9': '9_info9.jpg',
            'actor_image10': '9_info10.jpg',
            'actor_image11': '9_info11.jpg',
            'actors': [
                {'name': 'กนกฉัตร มรรยาทอ่อน', 'image': 'actorP.jpg'},
                {'name': 'สาวิตรี สุทธิชานนท์', 'image': 'actorQ.jpg'},
                {'name': 'Actor R', 'image': 'actorR.jpg'},
            ]
        },
    }

    movie = movies.get(id, {
        'title': 'Unknown Movie',
        'description': 'No description available',
        'poster': 'default.png',
        'actor_image': 'defaultactor.jpg',
        'actors': []
    })


    return render(request, 'toppick.html', {'movie': movie})



def coming_soon_detail(request, id):

    movie = {'id': id, 'title': f'Coming Soon {id}', 'description': 'ตัวอย่างหนัง'}
    return render(request, 'coming_soon_detail.html', {'movie': movie})

def celebrity_detail(request, id):

    celebrity = {'id': id, 'name': f'Celebrity {id}', 'bio': 'ข้อมูลของดารา'}
    return render(request, 'celebrity_detail.html', {'celebrity': celebrity})

def news_detail(request, id):

    news = {'id': id, 'title': f'News {id}', 'content': 'เนื้อหาข่าว'}
    return render(request, 'news_detail.html', {'news': news})

def search_movies(request):
    query = request.GET.get('q', '').strip()
    movies = {
        1: {'title': 'Green Book'},
        2: {'title': 'Black Panther'},
        3: {'title': 'Moonfall'},
        4: {'title': 'Titanic'},
        5: {'title': 'Friday the 13th'},
        6: {'title': '9Sadtra'},
    }
    
    for id, movie in movies.items():
        if movie['title'].lower() == query.lower():
            return redirect(reverse('toppick', args=[id]))
    return HttpResponse("Movie not found", status=404)